purien/SCLIB-ARDUINO/SCLib5c/examples/smartcard7_test_stm32_esp32_t1_v2c.ino
#include <Arduino.h>
#include <SCLib5c.h>

bool    fdebug=false ; 
bool    flocal=true; //false ; // false= modeX en reception
#define MY_PTCOL 0 
bool    auto_p=true  ;

#define MINIPRO_CLK 16 //8 or 16 MHZ

///////////////////
// #define STM32
#define WROOM32
// #define MINIPRO
// #define ATMEGA2560
// #define LEONARDO
// default NANO
////////////////////

// TA1=(char)0x11, F=372;  D=1;
// TA1=(char)0x12; F=372;  D=2;
// TA1=(char)0x13; F=372;  D=4;
// TA1=(char)0x14; F=372;  D=8 ;

#ifdef STM32
#define  LED PC13
#define  MYBAUD 115200 
#define  MY_FREQ  6000   
#define  MY_PTS   true   
#define  MY_TA    0x12 
#define  MySerial Serial1
#define  ATRVERBOSE

#elif defined(WROOM32)
#define  LED BUILTIN_LED 
#define  MYBAUD   115200 
#define  MY_FREQ  4000   
#define  MY_PTS   true   
#define  MY_TA    0x11 
//By default, only one Serialx instance is available mapped to the generic Serial name.
#define MySerial Serial
#define ATRVERBOSE

#else
#if defined(LEONARDO)
#define LED 13
#else
#define LED 13
#endif

#define  MYBAUD  19200
#define  MY_FREQ  4000   
#define  MY_PTS   true   
#define  MY_TA    0x11 
#define  MySerial Serial
#endif

uint16_t MyF = MY_FREQ    ;
bool     mypts=MY_PTS     ;
uint8_t  MyTA =MY_TA      ;
uint8_t  myptcol=MY_PTCOL ; // 0=>T0 or 1=>T1

bool    mycrc= false ;
uint8_t myifs= 254   ;
uint8_t lastpcb=0    ;

uint8_t last_send_sequence = 0    ;
uint8_t last_received_sequence = 0;
uint8_t finject=0;
uint8_t t1_error=0;
uint8_t T1_ERROR_MAX=3;
bool t1_parity_error=false;

uint8_t histlen=0   ;
uint8_t histbytes[15];

typedef struct
{
 /* Prologue field (NAD, PCB, LEN) */
 uint8_t nad;
 uint8_t pcb;
 uint8_t len;
 /* Epilogue field (EDC) */
 union 
 { uint8_t  edc_lrc;
   uint16_t edc_crc;
 };
 uint8_t edc_type; /* Type of used EDC */
 /* Information field (APDU) is handled by the lower layer */
 uint8_t *data;
} SC_TPDU;

/*
?  ENTER => mode LOCAL
A 00A4040006010203040500
A 00200001083030303030303030
A 008700000A

A 0087000004

A 0081000000
A 0089000000
A 0082000000


A 008700000A
A 0081000300
A 0089000300
A 0084060343
A 00800003201234567890ABCDEF1234567890ABCDEF1234567890ABCDEF1234567890ABCDEF
A 00C0000048
S 00B0000000
A 0084060043
A 00800000201234567890ABCDEF1234567890ABCDEF1234567890ABCDEF1234567890ABCDEF

A 00D00000F0A55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55A
A 00D00000FFA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA5

A 00B00000F0
S 00B0000000
*/


// If you are using a Arduino Mega compatible board you need to change the SC_C2_CLK to 11 as the TIMER1A
// is used for asynchronous clock generation (1MHz with just plain arduino code is no fun ;-) )
// and the SC_C1_VCC can be changed to any other "free" digital pin

#ifdef ATMEGA2560
#define SC_C7_IO     4 
#define SC_C2_RST    8  
#define SC_C1_VCC    10 
#define SC_C2_CLK    11  // timer 1 
//#define SC_C2_CLK  46  // Timer 5
//#define LED   3
//#define BPUSH 5
#define LED_ON   HIGH
#define LED_OFF  LOW  
#define ATRVERBOSE

#elif defined(STM32)
#define SC_C2_RST    PC15  
#define SC_C1_VCC    PC14  
#define SC_C7_IO     PB5    
#define SC_C2_CLK    PA6  
#define LED_ON   LOW
#define LED_OFF  HIGH
#define ATRVERBOSE

#elif defined(WROOM32)
#define SC_C2_RST    GPIO_NUM_17  
#define SC_C1_VCC    GPIO_NUM_16  
#define SC_C7_IO     GPIO_NUM_32      
#define SC_C2_CLK    GPIO_NUM_25  
#define LED_ON   HIGH
#define LED_OFF  LOW
#define ATRVERBOSE

#elif defined(MINIPRO)
#define SC_C2_RST    7  
#define SC_C1_VCC    6  
#define SC_C7_IO     8   
#define SC_C2_CLK    9  
#define LED_ON   HIGH
#define LED_OFF  LOW 

#elif defined(LEONARDO)
#define SC_C2_RST    7  
#define SC_C1_VCC    6  
#define SC_C7_IO     8   
#define SC_C2_CLK    9  
#define LED_ON   HIGH
#define LED_OFF  LOW 

#else // Arduino Nano
#define SC_C2_RST    10  
#define SC_C1_VCC    11  
#define SC_C7_IO     8   
#define SC_C2_CLK    9  
#define LED_ON   HIGH
#define LED_OFF  LOW  
#endif

/*
?
A 00A4040006010203040500
A 00200001083030303030303030

A 008700000A
A 0087000004

A 0081000000
A 0089000000
A 0082000000

A 0081000300
A 0089000300
A 0082000300

A 0084060343
A 00800003201234567890ABCDEF1234567890ABCDEF1234567890ABCDEF1234567890ABCDEF
A 00C0000048
S 00B0000000
A 0084060043
A 00800000201234567890ABCDEF1234567890ABCDEF1234567890ABCDEF1234567890ABCDEF

A 00D00000F0A55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55A
A 00B00000F0
A 00D00000FFA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA55AA5
A 00B00000FF
S 00B0000000

*/

// Create SmartCardReader object for further use
SmartCardReader5c sc((uint8_t)SC_C7_IO, (uint8_t)SC_C2_RST, (uint8_t)SC_C1_VCC,(uint8_t)SC_C2_CLK);

#define SIZE_APDU_BUF   3+261+2
#define SIZE_RESP_BUF   258+16 
#define SIZE_BUF1       SIZE_APDU_BUF+SIZE_RESP_BUF

char *apdu_buf= NULL ; 
char *resp_buf= NULL ; 
char mybuf[SIZE_BUF1];
 
