purien/SCLIB-ARDUINO/SCLib5c/examples/smartcard7_test_stm32_esp32_t1_v2c.ino
const char* cOK="OK";
const char* cERROR="ERROR";

void setup() 
{
  MySerial.begin(MYBAUD);
  while (!MySerial);

  sc.fscale=1;
  sc.UseTimer5= false;
  
  #ifdef MINIPRO
  sc.fscale= 16/ MINIPRO_CLK;
  #endif

  pinMode(LED, OUTPUT);
  digitalWrite(LED, LED_ON);
  delay(30);
  digitalWrite(LED, LED_OFF);
  delay(30);
  digitalWrite(LED, LED_ON);
  delay(30);
  digitalWrite(LED, LED_OFF);

if (fdebug)
{
#ifdef ATMEGA2560
MySerial.println("Atmega2560");

#elif defined (STM32)
MySerial.println("STM32");

#elif defined(MINIPRO)
MySerial.println("MINIPRO");

#elif defined(LEONARDO)
MySerial.println("LEONARDO");

#elif defined(WROOM32)
MySerial.println("ESP32");

#else
MySerial.println("NANO");

#endif
}
 
 apdu_buf=  mybuf ;
 resp_buf=  mybuf + SIZE_APDU_BUF + 3 ;

 //if (fdebug) CheckSC(mypts) ;
 sc.deactivate();

}

void loop()
{ char *cmd= NULL ;
  char *opt= NULL, v[3];
  int i,err,pt;
  char *MyBuf= mybuf;
  
  int nb= readBuffer(MyBuf,SIZE_BUF1,'\n');
  if (nb <= 0) return ;
  
  cmd = strtok(MyBuf, " \r\n");
  if (cmd == NULL) { MySerial.println("Ready"); return;}
  opt = strtok(NULL,"\r\n");
  pt = strlen(cmd);

 
   if (strcmp_P(cmd,PSTR("test"))==0)
   { int myct=0;
     int maxi=1;
     if (opt != NULL) maxi=atoi(opt);

     strcpy_P(MyBuf,PSTR("00A4040006010203040500"));
     err = Ascii2bin(MyBuf);
     err= send_apdu(apdu_buf,err,resp_buf,false,true);
     if (err <=0)  { MySerial.println(cERROR); return;}

     strcpy_P(MyBuf,PSTR("00200001083030303030303030"));
     err = Ascii2bin(MyBuf);
     err= send_apdu(apdu_buf,err,resp_buf,false,true);
     if (err <=0)  { MySerial.println(cERROR); return;}

     strcpy_P(MyBuf,PSTR("0081000000"));
     err = Ascii2bin(MyBuf);
     err= send_apdu(apdu_buf,err,resp_buf,false,true);
     if (err <=0)  { MySerial.println(cERROR); return;}

     strcpy_P(MyBuf,PSTR("0089000000"));
     err = Ascii2bin(MyBuf);
     err= send_apdu(apdu_buf,err,resp_buf,false,true);
     if (err <=0)  { MySerial.println(cERROR); return;}
   
     strcpy_P(MyBuf,PSTR("0082000000"));
     err = Ascii2bin(MyBuf);
     err= send_apdu(apdu_buf,err,resp_buf,false,true);
     if (err <=0)  { MySerial.println(cERROR); return;}  
     
     while(myct++ < maxi)
     {
     strcpy_P(MyBuf,PSTR("00800000201234567890ABCDEF1234567890ABCDEF1234567890ABCDEF1234567890ABCDEF"));
     err = Ascii2bin(MyBuf);
     if (err <=0)  { MySerial.println(cERROR); return;}
     err= send_apdu(apdu_buf,err,resp_buf,false,true);
     if (err <=0)  { MySerial.print(cERROR); MySerial.print(" "); MySerial.println(myct); return;}
     for(int i=0;i<err;i++)
     { Bin2ascii(resp_buf+i, 1, v);
       MySerial.print(v);
     }
     }
     MySerial.println();
   }

  
  else if (strcmp_P(cmd,PSTR("nodebug"))==0)
   { fdebug=false;
     MySerial.println(cOK); 
     return;
   }
   
   else if (strcmp_P(cmd,PSTR("debug"))==0)
   { fdebug=true;
     MySerial.println(cOK); 
     return;
   }

  else if (strcmp_P(cmd,PSTR("F"))==0) 
   { 
     if (opt==NULL)
     {
      MySerial.println(MyF); 
      return;
     }
     MyF= atoi(opt);
     MySerial.println(cOK); 
     return;
   }

   else if (strcmp_P(cmd,PSTR("ifs"))==0)
   {  
    if (opt == NULL)
    {
    MySerial.println(myifs);
    return;  
    }
    myifs= (uint8_t)atoi(opt);
    if (myptcol != (char)0)
     ifst1((uint8_t)myifs);
     MySerial.println(cOK); 
     return;
   }


   else if(strcmp_P(cmd,PSTR("retry"))==0)
   { 
     if (opt == NULL)
     { MySerial.println(T1_ERROR_MAX); 
       return;
     }
     err = atoi(opt) ;
     T1_ERROR_MAX=err     ;
     MySerial.println(cOK); 
     return;
   }
   else if(strcmp_P(cmd,PSTR("finject"))==0)
   { 
     if (opt == NULL)
     { MySerial.println(finject); 
       return;
     }
     err = atoi(opt) ;
     finject=err     ;
     MySerial.println(cOK); 
     return;
   }

   else if(strcmp_P(cmd,PSTR("ta"))==0) 
   {
   if (opt == NULL)
   { MySerial.println(0xFF & MyTA, HEX);
     return;
   }
   strcpy(MyBuf,opt);
   err = Ascii2bin(MyBuf);
   if (err <=0)  { MySerial.println(cERROR); return;}
   MyTA= MyBuf[0];
   MySerial.println(cOK); 
   return;
   }

   else if(strcmp_P(cmd,PSTR("pts"))==0)
   { 
     if (opt == NULL)
     { MySerial.println((int)MyTA-(int)0x10); 
       return;
     }
      
     err = atoi(opt)   ;
     MyTA = 0x10 + err ;
     mypts=true;
     MySerial.println(cOK); 
     return;
   }

    else if (strcmp_P(cmd,PSTR("nopts"))== 0)
   { mypts=false ;
     MySerial.println(cOK); 
     return;
   }

   else if (strcmp_P(cmd,PSTR("ptcol"))== 0)
   { MySerial.println(0xFF & myptcol); 
     return;
   }

   else if (strcmp_P(cmd,PSTR("t0"))== 0)
   { myptcol=(char)0 ;
     auto_p=false    ;
     MySerial.println(cOK); 
     return;
   }

   else if (strcmp_P(cmd,PSTR("t1"))== 0)
   { myptcol=(char)1 ;
     auto_p=false;
     MySerial.println(cOK); 
     return;
   }
   
   else if ( (strcmp_P(cmd,PSTR("on"))==0) || (strcmp_P(cmd,PSTR("w"))==0) )
   { bool fwarm=false;
     if (strcmp_P(cmd,PSTR("w"))==0) fwarm=true;
     if (opt != NULL)
     {
      err= Ascii2bin(opt);
      if (err != 1)  { MySerial.println(cERROR); return;}
      MyTA= *opt ;
      mypts=true ;
     }

     bool stat=false;
     unsigned long t1=micros();
     stat= CheckSC(mypts,fwarm);
     unsigned long t2=micros();

     if (fdebug){MySerial.print(t2-t1); 
                 MySerial.println("us");}
     
     if (stat) { MySerial.println(cOK); digitalWrite(LED, LED_ON);return;}
     else      { MySerial.println(cERROR);  digitalWrite(LED, LED_OFF);return;}
   }
   
   else if  (strcmp_P(cmd,PSTR("off"))==0)
   {  sc.deactivate();
      MySerial.println(cOK);
      digitalWrite(LED, LED_OFF);
      return;
   }


   else if  (( (strcmp_P(cmd,PSTR("A"))==0) || (strcmp_P(cmd,PSTR("S"))==0))  && (opt != NULL) )
   { bool fdata=false;
     if (strcmp_P(cmd,PSTR("S"))==0) fdata=true ;
     strcpy(MyBuf,opt);
     err = Ascii2bin(MyBuf);
     if (err <=0)  { MySerial.println(cERROR); return;}
     err= send_apdu(apdu_buf,err,resp_buf,fdata,true);
     if (err <=0)  { MySerial.println(cERROR); return;}
     for(int i=0;i<err;i++)
     { Bin2ascii(resp_buf+i, 1, v);
       MySerial.print(v);
     }
     MySerial.println();
     return;
    }

  else if  (strcmp_P(cmd,PSTR("hist"))==0)
   { if (histlen <=0)  
     { MySerial.println(cERROR); return;}
     
     for(char i=0;i<histlen;i++)
     { Bin2ascii(((char *)histbytes)+i,1, v);
       MySerial.print(v);
     }
     MySerial.println();
     return;
    }
 
   else 
   MySerial.println(cERROR);
   
 
  
