purien/SCLIB-ARDUINO/SCLib5c/examples/smartcard7_test_stm32_esp32_t1_v2c.ino
}

int readBufferX(char* buf,int count,char deb)
{
  int pos=0,len=0;
  char c;
  byte nb;
  bool found = false, fdata=false;

  if (deb == (char)'X') fdata=true;
  
  while (pos < (count-1) )
  {
    //if (MySerial.available() <= 0)
    //continue ;

    nb =  MySerial.readBytes(&c, 1) ;

    // if (nb == 0) continue;
    if (nb <= 0) return -1; // timeout (1000ms default)

    if (pos == 0)
    { len = 0xff & c ; len = 0xFF00 & (len << 8);  pos++; continue;}
    else if (pos == 1)
    { len |= (0xFF & c);  pos++; continue;}
    else
    { buf[(pos-2)] = c ; pos++;}
    
    if ((pos-2) == len)
    { found = true;
      break;
    }
  }

  if (!found)
  return 0;

  if (len > 261)
  return 0;
  
  memmove(apdu_buf,buf,len);
  int err= send_apdu(apdu_buf,len,resp_buf,fdata,true);
  if (err <=0)  { MySerial.write((byte)0xFF);
                  MySerial.write((byte)0x00);
                  MySerial.write((byte)0x00);
                  return 0;
                 }
    MySerial.write((byte)deb);
    MySerial.write((byte)(0xFF & err>>8));
    MySerial.write((byte)(0xFF & err));
    for(int i=0;i<err;i++) MySerial.write(resp_buf[i]);
  
    return 0;
}


int readBuffer(char* buf, int count, char delim)
{
  static int pos = 0;
  char c;
  byte nb;
  bool found = false;

  while (pos < (count - 1) )
  {
    int err= MySerial.available();
    if (err <= 0)
    { if (flocal)      return 0;
      else if (pos==0) return 0;
    }
     nb =  MySerial.readBytes(&c, 1) ;

    //if (nb == 0) return 0;
    if (nb <= 0)  // timeout
    { pos=0;
      return -1;
    }

    if (pos ==0)
    { if      (c== '?') {flocal=true; return 0;}
      else if (c== '#') {flocal=false; return 0;}
      else if ((c==(char)'x') || (c==(char)'X')) 
      { int err= readBufferX(buf,count-1,c);
        return err;
      }
    }
    
    buf[pos++] = c ;
 
    if (c == delim )
    { found = true;
      break;
    }
  }

  buf[pos] = '\0';
  nb = pos ;
  pos = 0;
  if (found) return nb;

  return 0;
}


boolean is_hexa(char *s)
{ int nb,i;
  char c;
  nb=strlen(s);
  for (int i=0;i<nb;i++)  
  if (isDigit(s[i]) == 0) return false;

  return true;
  
}

int isDigit(char c)
{ if (((int)c >= (int)'0') && ((int)c <= (int)'9')) return (1);
  if (((int)c >= (int)'A') && ((int)c <= (int)'F')) return (1);
  if (((int)c >= (int)'a') && ((int)c <= (int)'f')) return (1);
  return (0);
}


int Ascii2bin(char *Data_In)
{ int deb = -1, fin = -1, i, j = 0, nc, iCt = 0, len;
  long decimal_value = 0;
  char c;
  char *data_in = NULL;
  char *data_out = NULL;

  data_out = data_in = Data_In;

  len = (int) strlen(Data_In);

  for (i = 0; i < len; i++)
  { if      ( (deb == -1) && (isDigit(data_in[i])) )             {
      iCt = 1;
      deb = i;
    }
    else if ( (deb != -1) && (iCt == 1) && (isDigit(data_in[i])) ) {
      iCt = 2;
      fin = i;
    }

    if (iCt == 2)
    { c = data_in[fin + 1];
      data_in[deb + 1] = data_in[fin];
      data_in[deb + 2] = 0;

      decimal_value = strtol(&data_in[deb], NULL, 16);
      data_in[fin + 1] = c;

      c = (char)(0xFF & decimal_value);

      data_out[j++] = c ;
      deb = fin = -1; iCt = 0 ;
    }
  }

  return (j);
}


void Bin2ascii(char *bin, int len, char *buffer)
{ int i;
  for (i = 0; i < len; i++)
  {
    char nib1 = (bin[i] >> 4) & 0x0F;
    char nib2 = (bin[i] >> 0) & 0x0F;
    buffer[i * 2 + 0] = nib1  < 0xA ? '0' + nib1  : 'A' + nib1  - 0xA;
    buffer[i * 2 + 1] = nib2  < 0xA ? '0' + nib2  : 'A' + nib2  - 0xA;
  }
  buffer[len * 2] = '\0';
}

void dumpHEX(uint8_t* values, uint16_t size) {
  if (values != NULL && size > 0) {
    char ascii[17];
    for(uint16_t row=0; row<(size + 15)/16; row++) {
      // Print Adress
      if (row==0)
        MySerial.print("0");
      MySerial.print(row * 16, HEX);
      MySerial.print("|");

      // Prefill ascii
      for(int i=0; i<16; i++)
        ascii[i] = '.';
      ascii[16] = (char)0x00;
      // colums
      for(uint16_t pos=row*16; pos<(row + 1) * 16; pos++ ) {
        if(pos < size) {
          if(values[pos] < 0x10)
            MySerial.print("0");
          MySerial.print(values[pos], HEX);
          if(isPrintable(values[pos]))
            ascii[pos - row*16] = (char)values[pos];
        } else {
          MySerial.print("  ");
        }
        MySerial.print(" ");
      }
      MySerial.print("'");
      MySerial.print(ascii);
      MySerial.println("'");
    }
  }
}

bool PTS(uint8_t TA, uint8_t ptcol)
{
  uint8_t buf[4] =  {(uint8_t)0xFF, (uint8_t)0x10, (uint8_t)0x11, (uint8_t)0 };
  uint8_t buf2[4];
  int nb;

  buf[1] |= ptcol;
  buf[2]  = TA  ;

  buf[3] = buf[2] ^ buf[1] ^ buf[0] ;

  delayMicroseconds(sc._guardTime);

  for (uint8_t i=0; i < 4; i++)
  { 

//sc._sendByte(buf[i]);
sc._sendByteStd(buf[i]);
    
    delayMicroseconds(sc._guardTime);
  }

  for (uint8_t i = 0; i < 4; i++) buf2[i] = (char)0xA5;

  nb = 0;
  for (uint8_t i = 0; i < 4; i++)
  {
// if (sc._receiveByte((uint8_t*)(buf2 + i), sc._max_wwt) != 0)  break;
   if (sc._receiveByteStd((uint8_t*)(buf2 + i), sc._max_wwt) != 0)  break;

    nb++;
  }

if (fdebug)
{
dumpHEX((uint8_t*)buf, 4);
if (nb >0) dumpHEX((uint8_t*)buf2, nb);
}

  if (nb != 4) 
    return false;
  
   for (uint8_t i=0;i<4;i++)
   if (buf[i] != buf2[i])
   return false;
   
   return true;
 

}

#define NTD 4
typedef struct ifd_atr_info {
    /* The following contain -1 if the field wasn't present */
    int  TA[NTD];
    int  TB[NTD];
    int  TC[NTD];
    int supported_protocols;
    int  default_protocol  ;
    int  t1;
    int  t15;
  } ifd_atr_info_t;
  
int ifd_atr_parse(ifd_atr_info_t * info, unsigned char *atr, unsigned int len);

int ifd_atr_parse(ifd_atr_info_t * info, unsigned char *atr, unsigned int len)
{
  unsigned int m, n, k=0,i,lenh=0;
  int fTCK=0;

  /* Initialize the atr_info struct */
  memset(info, 0, sizeof(*info));
  info->default_protocol = -1;
  for (n = 0; n < NTD; n++) {
    info->TA[n] = -1;
    info->TB[n] = -1;
    info->TC[n] = -1;
    info->t1= -1;
    info->t15= -1;
  }

  if (len < (unsigned int)(2 + ((atr[1] & 0x0f)) ))
    return -1; // ERROR_INVALID_ATR;

  /* Ignore hystorical bytes */
  lenh = atr[1] & 0x0f;
  len -= lenh;

