purien/SCLIB-ARDUINO/SCLib5c/examples/smartcard7_test_stm32_esp32_t1_v2c.ino
  for (m = 0, n = 2; n < len; m++) {
    unsigned int TDi;

    /* TA1, TA2, TA3, TA4 are legal, TA5 wouldn't be */
    if (m >= NTD)
      return -2 ; //ERROR_INVALID_ATR;

    TDi = atr[n - 1]; // n=2 => T0
    if (n != 2) 
    { unsigned int prot;
      prot = TDi & 0x0f;
      if ((prot == 15) &&  (info->t15 == -1) )          info->t15= m-1 ;
      if ( (prot == 1) &&  (info->t1 == -1) && (m>1) )  info->t1 = m-1 ;
      if (info->default_protocol < 0) info->default_protocol = prot;
      info->supported_protocols |= (1 << prot);
    }

    //k = ifd_count_bits(TDi & 0xF0);

    k=0;
    if (TDi & 0x10) k++;
    if (TDi & 0x20) k++;
    if (TDi & 0x40) k++;
    if (TDi & 0x80) k++;

    // n-1+k  0...len-1  n-1+k <= len-1 n+k <= len

    if ((n + k) > len) 
    return -3; //ERROR_INVALID_ATR;
     
    if (TDi & 0x10)
    info->TA[m] = atr[n++];
    if (TDi & 0x20)
    info->TB[m] = atr[n++];
    if (TDi & 0x40)
    info->TC[m] = atr[n++];
    if (!(TDi & 0x80)) // TDi (i= m+1) is absent end of ATR
    {
      /* If the ATR indicates we support anything in addition to T=0, 
       * there'll be a TCK byte
       * at the end of the string.
       * For now, simply chop it off. Later we may want to verify it.
       */
      // If only T=0 is indicated, possibly by default, byte TCK shall be absent. 
      if (info->supported_protocols & ~0x1)
      { fTCK=1; len--;}

      // n= len
      // MAIS si il y a un byte TCK en plus (non STD) n = len-1

      break;
    }
    n++;
  }

  /* ATR didn't list any supported protocols, so we default to T=0 */
  if (info->supported_protocols == 0) 
  {
    info->supported_protocols = 0x01;
    info->default_protocol = 0; //PROTOCOL_T0;
  }

  if (fTCK)
  { k=0;
      for(i=1;i<(len+lenh);i++)
      k= k ^ atr[i];

    if (k != (uint16_t)atr[len+lenh])
      return -10; // TCK ERROR
   }

  // return number of extra bytes after historical bytes
  return fTCK + len - n;
}

void FiDi(unsigned char ta,int * Fi,int *Di)
{ unsigned char D,F;
  F = (unsigned char)(ta >> 4) ;
  D = (unsigned char)(ta & 0xF);
  *Fi=-1;
  *Di=-1;

  switch (F)
  { case 0:
    case 1:
    *Fi=372;break;
    break;
    case 2:
    *Fi=558;break;
    case 3:
    *Fi= 744;break;
    case 4:
    *Fi= 1116;break;
    case 5:
    *Fi= 1488;break;
    case 6:
    *Fi= 1860;break;
    case 7:
    case 8:
    break;
    case 9:
    *Fi=512;break;
    case 10:
    *Fi=758;break;
    case 11:
    *Fi=1024;break;
    case 12:
    *Fi=1536;break;
    case 13:
    *Fi=2048;break;
    case 14:
    case 15:
    default:
    break;
    break;
    
  }

   switch (D)
  { case 0:
    break;
    case 1:
    *Di=1;break;
    break;
    case 2:
    *Di=2;break;
    case 3:
    *Di=4;break;
    case 4:
    *Di=8;break;
    case 5:
    *Di=16;break;
    case 6:
    *Di=32;break;
    case 7:
    break;
    case 8:
    *Di=12;break;
    case 9:
    *Di=20;break;
    case 10:
    case 11:
    case 12:
    case 13:
    case 14:
    case 15:
    default:
    break;
 }
 
}

bool CheckSC(bool pts,bool warm)
{ uint8_t data[MAX_ATR_BYTES];
  uint16_t atr_received = 0;
  int fs=2000, D = 1, F = 372, N = 0;
  int CWI = 13, BWI = 4, WI = 10;
  int Fi=-1,Di=-1;
  ifd_atr_info_t info;
  uint8_t cardifs=0;
  uint8_t ptsct=0 ;
  uint8_t ptcol=0 ;

  if (fdebug)MySerial.println();
 
  // Parameter N is the extra guardtime used to send characters from the interface device to the card. 
  // No extra guardtime is used to send characters from the card to the interface device. 
  // The default value is N = 0.
  // In the range 0 to 254, N indicates that, before being ready to receive the next character, the card requires the
  // following delay from the leading edge of the previous character (sent either by the card or by the interface device).
  // 12 etu + (Q x N/F)
  // In the formula, Q shall take either one of the two values:
  // - F/D, i.e., the values used for computing the etu, if T=l5 is absent in the Answer-to-Reset;
  // - Fi/Di if T=l5 is present in the Answer-to-Reset.
  // etu = Fi/Di/fs, 12 etu + N. etu
  
  fs= sc.fclk = MyF;
  mycrc=false;
 
 // F/D/fs
 // fs=1  F=512 D=8   etu=64
 // fs=1  F=512 D=16  etu=32
 // fs=2  F=512 D=4   etu=64
 // fs=2  F=512 D=8   etu=32
 // fs=4  F=512 D=2   etu=64
 // fs=4  F=512 D=4   etu=32


  sc.ignoreParityErrors(false);
  if (!warm) atr_received  = sc.activate(data, MAX_ATR_BYTES)   ;
  else       
  { // warm reset
    pinMode(SC_C7_IO,INPUT) ;  
    sc.use_ts= true;
    atr_received  = sc._WarmReset(data, MAX_ATR_BYTES) ;
    sc.use_ts= false;
    // use ts to measure _etu, or compute _etu from clock frequency
    // compute  _guardTime,  _wwt, _max_wwt; 

    /*
    pinMode(SC_C7_IO, INPUT) ;  
    digitalWrite( SC_C2_RST, LOW );
    delayMicroseconds(1000);
    digitalWrite(SC_C2_RST,HIGH);
    data[0]=0xFF;
    int v = digitalRead(SC_C7_IO); 
    int err= sc._receiveByteStd(data,40000) ;
    sc.lasterror= 0;
    uint8_t err= sc._receiveTSByte();
    MySerial.println(sc._etu);
    MySerial.println(v);
    MySerial.println(data[0],HEX);
    MySerial.println(err,HEX);
    MySerial.println(sc.lasterror);
    */
  }
  
  int ftck= -1;
  if (atr_received >0) ftck= ifd_atr_parse(&info,data,atr_received);
  if (ftck >=0) 
  { ftck= ifd_atr_parse(&info,data,atr_received);

    #ifdef ATRVERBOSE
    if (fdebug)
    {
    MySerial.print("T");MySerial.print(info.default_protocol);MySerial.print(" {");
    if (info.supported_protocols & 0x1) MySerial.print("T0 ");
    if (info.supported_protocols & 0x2) MySerial.print("T1"); 
    MySerial.println("}");
    }
    #endif

    if (auto_p)
    {
    if (info.supported_protocols & 0x1)      ptcol=0;
    else if (info.supported_protocols & 0x2) ptcol=1; 
    else ptcol=0 ;
    myptcol=ptcol;
    }
    else
    ptcol=myptcol;
    
    for (int i=0;i<NTD;i++)
    { if (info.TA[i] != -1) 
      { 
        #ifdef ATRVERBOSE
        if (fdebug) {MySerial.print("TA"); MySerial.print(i+1);MySerial.print("= ");MySerial.println(info.TA[i],HEX);}
        #endif
        if (i == 0)
        { Fi = 0x0F & (info.TA[i]>>4) ;
          Di = 0x0F & info.TA[i];
          #ifdef ATRVERBOSE
          if (fdebug) {MySerial.print("Fi=");MySerial.print(Fi);MySerial.print(" Di=");MySerial.println(Di);}
          #endif
        }
      }
      if (info.TB[i] != -1) 
      { 
        #ifdef ATRVERBOSE
        if (fdebug) {MySerial.print("TB"); MySerial.print(i+1);MySerial.print("= ");MySerial.println(info.TB[i],HEX);}
        #endif
      }
      if (info.TC[i] != -1) 
      { 
        #ifdef ATRVERBOSE
        if (fdebug) {MySerial.print("TC"); MySerial.print(i+1);MySerial.print("= ");MySerial.println(info.TC[i],HEX);}
        #endif
        
        if (i == 0)
        { N = 0xFF & info.TC[i];
          #ifdef ATRVERBOSE
          if (fdebug) {MySerial.print("N="); MySerial.println(N);};
          #endif
          if (N==255) N=0;
        }
      }
    }
    if (info.t1 != -1) 
    { 
      #ifdef ATRVERBOSE
      if (fdebug) {MySerial.print("T1i=");MySerial.println(info.t1+1);}
      #endif
      
