purien/SCLIB-ARDUINO/SCLib5c/examples/smartcard7_test_stm32_esp32_t1_v2c.ino
     if ( ((info.t1+1) > 1) && ((info.t1+1) < NTD) )
     {
      if (info.TA[info.t1+1] != -1)
      { cardifs = 0xFF & info.TA[info.t1+1];
        #ifdef ATRVERBOSE
        if (fdebug) {MySerial.print("IFS=");MySerial.println(cardifs);}
        #endif
        //myifs=cardifs ;
      }
      if (info.TB[info.t1+1] != -1)
      { CWI = 0x0F & info.TB[info.t1+1];
        #ifdef ATRVERBOSE
        if (fdebug) {MySerial.print("CWI=");MySerial.println(CWI);}
        #endif
        BWI = 0x0F & (info.TB[info.t1]>>4);
        #ifdef ATRVERBOSE
        if (fdebug) {MySerial.print("BWI=");MySerial.println(BWI);}
        #endif
      }
      if (info.TC[info.t1+1] != -1)
      { if (info.TC[info.t1+1] & 0x01) { mycrc= true ;
                                         #ifdef ATRVERBOSE
                                         if (fdebug) MySerial.println("CRC");
                                         #endif
                                       }
        else                           { mycrc=false ;
                                         #ifdef ATRVERBOSE
                                         if (fdebug) MySerial.println("EDC");
                                         #endif
                                       }
      }
    }
    }

    if (info.t15 != -1) 
    { 
      #ifdef ATRVERBOSE
      if (fdebug) {MySerial.print("T15i=");MySerial.println(info.t15+1);}
      #endif
    }
  
    
  }
  
 #ifdef ATRVERBOSE
 if (fdebug)
  {
  MySerial.print("SC Frequency = ");
  MySerial.print(sc.fclk/sc.fscale);
  MySerial.println(" KHz");
  MySerial.print("TCK = ");
  MySerial.println(ftck);
  }
  #endif
 
  if (ftck < 0)
  {
  histlen=atr_received;
  for (uint8_t i=0;i<histlen; i++)
    histbytes[i] = data[i];
  }
  else
  { histlen= 0x0F & data[1];
    for (uint8_t i=0;i<histlen; i++)
    histbytes[i] = data[atr_received-histlen-ftck+i];
  }
  
  if ( (atr_received > 0) && (pts == true) )
  { 
    pts=false;
    while (!pts && (ptsct < 1) )
    {
     pts= PTS(MyTA,ptcol);
     if (!pts) // pts fail => try warm reset
     {  ptsct++;
        atr_received = sc._WarmReset(data, MAX_ATR_BYTES);
        if (atr_received <= 0) break ;
     }
    }

    if (!pts)
    { 
      #ifdef ATRVERBOSE
      if (fdebug)  MySerial.println("\nNo PTS");
      #endif
      atr_received = sc.activate(data,MAX_ATR_BYTES);
      pts=false;
    }
    else
    { 
      #ifdef STM32
      if (fdebug) MySerial.println("PTS OK");
      #endif
      pts = true ;
    }
    
  }

 // update pts for next restart
 mypts=pts; 

if ( atr_received > 0)
{
if (fdebug) dumpHEX(data, atr_received);

    // The specific interface byte TC(2) codes the integer value WI over the eight bits; 
    // the null value is reserved for future use.
    // If no TC(2) appears in the Answer-to-Reset, then the default value is WI = 10.
    // The interval between the leading edge of any character sent by the card 
    // and the leading edge of the previous character (sent either by the card 
    // or by the interface device) shall not exceed 960 x WI x (Fi / f). 
    // This maximum delay is named the work waiting time.

    //   T=0
    //   WWT = WI . 960 . F/f secondes, le temps d'attente maximum d'une réponse carte par le lecteur.

    // T=1
    // CWT = (2**CWI + 11)etu  CWI=0, 12, 1+8+1+2 Character Waiting Time
    // BWT = (2**BWI X 960 X 372 / fs) seconde + 11 etu // 5,713,920 /fs  + 11 etu
    // BGT is defined as the minimum delay between the leading edges 
    // of two consecutive characters sent in opposite directions. 
    // The value of BGT shall be 22 etu.


    /*
    if (fdebug)
    {
    MySerial.print("etu =");
    MySerial.print(sc._etu);
    MySerial.print(" guardTime=");
    MySerial.print(sc._guardTime);
    MySerial.print(" wwt=");
    MySerial.print(sc._wwt);
    MySerial.print(" max_wwt=");
    MySerial.println(sc._max_wwt);
    }
    */


    if (!pts)
    { F=372; D=1;}

    else
    { /*
      if      (MyTA == (char)0x11) { F=372;  D=1;}
      else if (MyTA == (char)0x12) { F=372;  D=2;}
      else if (MyTA == (char)0x13) { F=372;  D=4;}
      else if (MyTA == (char)0x14) { F=372;  D=8;}
      */
      FiDi(MyTA,&F,&D);
    }

    if (fdebug)
    {
    MySerial.print("F= ");
    MySerial.print(F);
    MySerial.print(" D= ");
    MySerial.println(D);
    }

     sc._etu       = (long) ((long)sc.fscale * F*(long)1000) / (long)D  / (long)fs ; // (us) =  F/D/fs (en MHz), F=372, D=1 fs=2

#ifdef TIMERX4
     sc._Setu      = (long) ((long)sc.fscale * F*(long)1000*(long)16) / (long)D  / (long)fs ; // (us) 
#endif

#ifdef TIMERX2
     sc._Setu2     = (long) ((long)sc.fscale * F*(long)1000*(long)2)  / (long)D  / (long)fs ; // (us) =  F/D/fs (en MHz), F=372, D=1 fs=2
#endif

#ifdef ASTM32
     sc._Setu     = (long) ((long)sc.fscale * (long)FTX* F *(long)1000) / (long)D  / (long)fs ; // (us) =  F/D/fs (en MHz), F=372, D=1 fs=2
#endif
     
     sc._guardTime = ((long)2 + (long)N) * (long)sc._etu;
     sc._wwt       = (long)WI * (long)960 * (long)D * (long)sc._etu ;
     sc._max_wwt   = sc._wwt ;

     sc._cwt = ((long)12 * sc._etu) ;
     sc._bwt = (long)(10000000L)   ;//(long)(5000000L);
     sc._bgt = 1L*((long)22 * sc._etu);
     if (myptcol != (char)0) 
     { sc._guardTime= (2L * sc._etu);// 10 + 2
       sc._cwt = (((long)1<<CWI)+ 11L) * sc._etu ;
       last_send_sequence = 0    ;
       last_received_sequence = 0;
     }

     if (fdebug)
     { MySerial.print("etu =")  ;
       MySerial.println(sc._etu);
       
     #ifdef ATRVERBOSE
        
    #ifdef ASTM32
     MySerial.print("Super_etu= ");
     MySerial.println(sc._Setu);
    #endif
       
      #ifdef TIMERX4
       MySerial.print("Super_etu= ");
       MySerial.println(sc._Setu);
      #endif
     
     #ifdef TIMERX2
     MySerial.print("Super_etu=");
     MySerial.println(sc._Setu2);
     #endif
     
    MySerial.print("guardTime= ");
    MySerial.print(sc._guardTime);
    if (myptcol == (char)0)
    { 
    MySerial.print(" wwt=");
    MySerial.print(sc._wwt);
    MySerial.print(" max_wwt=");
    MySerial.println(sc._max_wwt);
    }
    else
    {
    MySerial.print(" cwt= ");
    MySerial.print(sc._cwt);
    MySerial.print(" bwt=");
    MySerial.print(sc._bwt);  
    MySerial.print(" bgt=");
    MySerial.println(sc._bgt);  
    }
#endif
   }
        
