purien/SCLIB-ARDUINO/SCLib5c/examples/smartcard7_test_stm32_esp32_t1_v2c.ino
}
  else
  {
   //if (fdebug) MySerial.println("no smartcard ...");
   sc.deactivate();
   return false;
  }

  if (myptcol == 1) ifst1(myifs);
  return true;
}

void myPrintf(char *str, char *vli, int size)
{ int i;
  char buf[80];

  if (size <= 0) return ;
  
  sprintf(buf, "%s: %d", str,size);
  MySerial.println(buf);
  buf[0] = 0;
  for (i = 0; i < size; ++i)
  {
    sprintf(&buf[strlen(buf)], "%02X", 0xFF & (unsigned)vli[i]);
    if (i % 32 == 31)
    {  MySerial.println(buf);
      buf[0] = 0;
    }
  }

  i--;
  if ((i % 32) != 31)
     MySerial.println(buf);
}


/********** T=1 TPDU block ********************/
#define TPDU_T1_DATA_MAXLEN  254

#define PCB_M_POS   5
#define PCB_M_MSK   (0x1 << PCB_M_POS)
#define PCB_M_NO_CHAIN    (0x0 << PCB_M_POS)
#define PCB_M_CHAIN   (0x1 << PCB_M_POS)

#define PCB_IBLOCK_POS    7
#define PCB_IBLOCK_MSK    (0x1 << PCB_IBLOCK_POS)
#define PCB_IBLOCK    (0x0 << PCB_IBLOCK_POS)

#define PCB_RBLOCK_POS    6
#define PCB_RBLOCK_MSK    (0x3 << PCB_RBLOCK_POS)
#define PCB_RBLOCK    (0x2 << PCB_RBLOCK_POS)

#define PCB_SBLOCK_POS    6
#define PCB_SBLOCK_MSK    (0x3 << PCB_SBLOCK_POS)
#define PCB_SBLOCK    (0x3 << PCB_SBLOCK_POS)

#define PCB_ISEQ_NUM_POS  6
#define PCB_ISEQ_NUM_MASK (0x1 << PCB_ISEQ_NUM_POS)
#define PCB_ISEQ_NUM0   (0x0 << PCB_ISEQ_NUM_POS)
#define PCB_ISEQ_NUM1   (0x1 << PCB_ISEQ_NUM_POS)

#define PCB_RSEQ_NUM_POS  4
#define PCB_RSEQ_NUM_MASK (0x1 << PCB_RSEQ_NUM_POS)
#define PCB_RSEQ_NUM0   (0x0 << PCB_RSEQ_NUM_POS)
#define PCB_RSEQ_NUM1   (0x1 << PCB_RSEQ_NUM_POS)

#define PCB_ERR_POS   0
#define PCB_ERR_MASK    (0x3 << PCB_ERR_POS)
#define PCB_ERR_NOERR   (0x0 << PCB_ERR_POS)
#define PCB_ERR_EDC   (0x1 << PCB_ERR_POS)
#define PCB_ERR_OTHER   (0x2 << PCB_ERR_POS)

/* SBLOCK types */
#define SBLOCK_TYPE_MSK   0x3f
#define SBLOCK_RESYNC_REQ 0x00
#define SBLOCK_RESYNC_RESP  0x20
#define SBLOCK_CHANGE_IFS_REQ 0x01
#define SBLOCK_CHANGE_IFS_RESP  0x21
#define SBLOCK_ABORT_REQ  0x02
#define SBLOCK_ABORT_RESP 0x22
#define SBLOCK_WAITING_REQ  0x03
#define SBLOCK_WAITING_RESP 0x23
#define SBLOCK_VPP_ERR_RESP 0x24

#define EDC_TYPE_LRC    0
#define EDC_TYPE_CRC    1

/////////////////////////////////////////////////////////////
/***************** T=1 case ********************************/
/* Compute the checksum (LRC) of a TPDU */
uint8_t SC_TPDU_T1_lrc(SC_TPDU *tpdu){
  unsigned int i;
  uint8_t lrc = 0;

  if(tpdu == NULL){
    return 0;
  }

  lrc ^= tpdu->nad;
  lrc ^= tpdu->pcb;
  lrc ^= tpdu->len;
  for(i = 0; i < tpdu->len; i++){
    lrc ^= tpdu->data[i];
  }

  return lrc;
}

/* Compute the checksum (CRC-16) of a TPDU */
/* [RB] TODO: check the CRC-16 algorithm ... */
#define CRC_BLOCK(in, crc, poly) do {     \
  unsigned int j;         \
  uint32_t data;          \
  data = (in);          \
  for(j = 0; j < 8; j++){       \
    if(((crc) & 0x0001) ^ (data & 0x0001)){ \
      (crc) = ((crc) >> 1) ^ (poly);  \
    }         \
    else{         \
      (crc) >>= 1;      \
    }         \
    data >>= 1;       \
  }           \
} while(0);

uint16_t SC_TPDU_T1_crc(SC_TPDU *tpdu){
  unsigned int i;
  uint32_t poly = 0x8408; /* CCIT polynomial x16 + x12 + x5 + 1 */
  uint32_t crc  = 0xffff;

  if(tpdu == NULL){
    return 0;
  }

  CRC_BLOCK(tpdu->nad, crc, poly);
  CRC_BLOCK(tpdu->pcb, crc, poly);
  CRC_BLOCK(tpdu->len, crc, poly);
  for(i = 0; i < tpdu->len; i++){
    CRC_BLOCK(tpdu->data[i], crc, poly);
  }

  crc = ~crc;
  crc = (crc << 8) | ((crc >> 8) & 0xff);

  return (uint16_t)crc;
}

/* Compute the checksum of a TPDU */
void SC_TPDU_T1_checksum_compute(SC_TPDU *tpdu, int fcrc)
{

  if(tpdu == NULL)
  {
    return;
  }

  /* The method used for the checksum depends on ATR byte (LRC or CRC). Default is LRC.
   * TCi (i>2) contains this information.
   */
  tpdu->edc_type = EDC_TYPE_LRC;
  if (fcrc) 
  tpdu->edc_type = EDC_TYPE_CRC;
  

  if(tpdu->edc_type == EDC_TYPE_LRC){
    /* LRC is the xor of all the bytes of the TPDU */
    tpdu->edc_lrc = SC_TPDU_T1_lrc(tpdu);
    return;
  }
  else{
    /* CRC type */
    tpdu->edc_crc = SC_TPDU_T1_crc(tpdu);
  }

  return;
}
/* Check the checksum of a TPDU */
int SC_TPDU_T1_checksum_check(SC_TPDU *tpdu){

  if(tpdu == NULL){
    return 0;
  }

  if(tpdu->edc_type == EDC_TYPE_LRC){
    /* LRC is the xor of all the bytes of the TPDU */
    if(tpdu->edc_lrc != SC_TPDU_T1_lrc(tpdu)){
      return 0;
    }
  }
  else{
    /* CRC type */
    if(tpdu->edc_crc != SC_TPDU_T1_crc(tpdu)){
      return 0;
    }
  }

  return 1;
}


void testcrc()
{ //char testcrc[5]= {0xA5,0x81,0x00,0xB2,0x65};
  SC_TPDU tpdu  ;
  char crc[2]   ;
  tpdu.nad=0xA5 ;
  tpdu.pcb=0x81 ;     
  tpdu.len=0x00 ;
  tpdu.data= (uint8_t *)NULL ;
  SC_TPDU_T1_checksum_compute(&tpdu,1);
  crc[0] = 0xFF & tpdu.edc_crc >> 8  ;
  crc[1] = 0xFF & tpdu.edc_crc ;
  //B265
  myPrintf("CRC",crc,2);
}


int ifst1(uint8_t ifs)
{ uint8_t p1[6] ;
  int i,ledc=1  ;
  SC_TPDU tpdu  ;
  
  delayMicroseconds(sc._bgt);

  if (mycrc) ledc++;
 
  tpdu.nad=0;
  tpdu.pcb=0xC1     ; //IFS REQUEST
  tpdu.len=0x01     ;
  tpdu.data= (uint8_t *)&ifs  ;
  SC_TPDU_T1_checksum_compute(&tpdu,mycrc);

  p1[0]=tpdu.nad;
  p1[1]=tpdu.pcb;
  p1[2]=tpdu.len;
  p1[3]=tpdu.data[0];
  if (!mycrc) p1[4]=tpdu.edc_lrc;
  else
  {p1[4] =tpdu.edc_crc >> 8  ;
   p1[5] =tpdu.edc_crc & 0xFF;
  }

   if (fdebug) myPrintf("TxT1",(char*)p1,4+ledc);
   sc._sendASyncBytes_T1(p1,4+ledc); 
   int result= sc._receiveASyncBytes_T1(p1,4+ledc,sc._bwt,sc._cwt);
   if (fdebug) myPrintf("RxT1",(char *)p1,result);
   delayMicroseconds(sc._bgt);

   return 0;
  
}


/* Push a TPDU on the line */
int SC_push_TPDU_T1(SC_TPDU *tpdu)
{
int err=0; // 0= OK, 1=ERROR
int ledc=1   ;
uint8_t p1[5];

if (mycrc) ledc++;

p1[0]=tpdu->nad;
p1[1]=tpdu->pcb;
p1[2]=tpdu->len;
if (!mycrc)
p1[3]=tpdu->edc_lrc;
else
{p1[3] =tpdu->edc_crc >> 8  ;
 p1[4] =tpdu->edc_crc & 0xFF;
}
   if (fdebug) myPrintf("TxT1",(char *)p1,3+ledc);

   if ((finject & (uint8_t)0x1) == (uint8_t)0x1)
   {
     finject &= (uint8_t)0xFE ;
     p1[3] ^= (uint8_t)1;
   }

   sc._sendASyncBytes_T1(p1,3);
   sc._sendASyncBytes_T1((uint8_t *)tpdu->data,(uint16_t)tpdu->len);
   sc._sendASyncBytes_T1(p1+3,(uint16_t)ledc);
 
   lastpcb= tpdu->pcb;

