purien/SCLIB-ARDUINO/SCLib5c/examples/smartcard7_test_stm32_esp32_t1_v2c.ino
return err;
}

/* Pull a TPDU from the line */
int SC_pull_TPDU_T1(SC_TPDU *tpdu,uint8_t bwt_factor)
{
int err=0; //0 =OK 1=ERROR
uint16_t result=0 ;
int t1rx=0;
int ledc=1;
uint8_t p1[5];

if (mycrc) ledc++;

 t1rx=254+4; //Max + 4
 if (mycrc) t1rx += 1;

  
    // uint16_t _receiveASyncBytes_T1(uint8_t* buf, uint16_t buf_size,unsigned long bwt,unsigned long cwt);
   sc.t1_parity_err=0   ;
   t1_parity_error=false;
   result= sc._receiveASyncBytes_T1((uint8_t*)tpdu->data,t1rx,sc._bwt,sc._cwt);
   delayMicroseconds(sc._bgt);
   if (sc.t1_parity_err != 0) t1_parity_error=true;

   if (result > 0)
   {
   tpdu->nad = tpdu->data[0];
   lastpcb= tpdu->pcb = tpdu->data[1];
   tpdu->len = tpdu->data[2];
   if (mycrc) 
   { tpdu->edc_crc  = (0xFF00 & (tpdu->data[3+tpdu->len]<<8)) ;
     tpdu->edc_crc |= (0x00FF &  tpdu->data[4+tpdu->len]) ;
   }
   else
   tpdu->edc_lrc = tpdu->data[3+tpdu->len] ;

   if ((finject & (uint8_t)0x2) == (uint8_t)0x2)
   {
     finject &= (uint8_t)0xFD   ;  // 1101
     tpdu->edc_lrc ^= (uint8_t)1;
   }

   
   memmove(tpdu->data,tpdu->data+3,tpdu->len);
   lastpcb =  tpdu->pcb; ;

   p1[0]=tpdu->nad;
   p1[1]=tpdu->pcb;
   p1[2]=tpdu->len;
   if (!mycrc)
   p1[3]=tpdu->edc_lrc;
   else
   { p1[3] =tpdu->edc_crc >> 8  ;
     p1[4] =tpdu->edc_crc & 0xFF;
   }

   if (fdebug) myPrintf("RxT1",(char *)p1,3+ledc);
   return 0;
   }

lastpcb=0xFF;
return 1    ;
}
/*** T=1 helpers for block types and error handling ***/
int SC_TPDU_T1_is_IBLOCK(SC_TPDU *tpdu){
  if(tpdu == NULL){
    return 0;
  }
  return ((tpdu->pcb & PCB_IBLOCK_MSK) == PCB_IBLOCK);
}

int SC_TPDU_T1_is_RBLOCK(SC_TPDU *tpdu){
  if(tpdu == NULL){
    return 0;
  }
  return ((tpdu->pcb & PCB_RBLOCK_MSK) == PCB_RBLOCK);
}

int SC_TPDU_T1_is_SBLOCK(SC_TPDU *tpdu){
  if(tpdu == NULL){
    return 0;
  }
  return ((tpdu->pcb & PCB_SBLOCK_MSK) == PCB_SBLOCK);
}

void SC_TPDU_T1_set_IBLOCK(SC_TPDU *tpdu){
  if(tpdu == NULL){
    return;
  }
  tpdu->pcb |= PCB_IBLOCK;
  return;
}

void SC_TPDU_T1_set_RBLOCK(SC_TPDU *tpdu){
  if(tpdu == NULL){
    return;
  }
  tpdu->pcb |= PCB_RBLOCK;
  return;
}

void SC_TPDU_T1_set_SBLOCK(SC_TPDU *tpdu){
  if(tpdu == NULL){
    return;
  }
  tpdu->pcb |= PCB_SBLOCK;
  return;
}

uint8_t SC_TPDU_T1_get_sequence(SC_TPDU *tpdu){
  if(tpdu == NULL){
    return 0xff;
  }
  if(SC_TPDU_T1_is_IBLOCK(tpdu)){
    return ((tpdu->pcb & PCB_ISEQ_NUM_MASK) >> PCB_ISEQ_NUM_POS);
  }
  else if(SC_TPDU_T1_is_RBLOCK(tpdu)){
    return ((tpdu->pcb & PCB_RSEQ_NUM_MASK) >> PCB_RSEQ_NUM_POS);
  }
  else{
    /* Should not happen */
    return 0xff;
  }
}

int SC_TPDU_T1_is_sequence_ok(SC_TPDU *tpdu, uint8_t sequence_number){
  return (SC_TPDU_T1_get_sequence(tpdu) == sequence_number);
}


int SC_TPDU_T1_set_sequence(SC_TPDU *tpdu, uint8_t sequence_number){
  if(tpdu == NULL){
    return -1;
  }
  if(SC_TPDU_T1_is_IBLOCK(tpdu)){
    tpdu->pcb |= (sequence_number << PCB_ISEQ_NUM_POS);
    return 0;
  }
  else if(SC_TPDU_T1_is_RBLOCK(tpdu)){
    tpdu->pcb |= (sequence_number << PCB_RSEQ_NUM_POS);
    return 0;
  }
  else{
    return -1;
  }
}

uint8_t SC_TPDU_T1_RBLOCK_get_error(SC_TPDU *tpdu){
  if(tpdu == NULL){
    return 0xff;
  }
  /* Return an error if this is not an RBLOCK */
  if(!SC_TPDU_T1_is_RBLOCK(tpdu)){
    return 0xff;
  }
  return (tpdu->pcb & PCB_ERR_MASK);
}
/* Send an error frame with the given error and the given frame sequence */
int SC_TPDU_T1_send_error(uint8_t pcb_err, uint8_t sequence_number, int fcrc)
{
  SC_TPDU err_tpdu;

  err_tpdu.nad = 0;

  /* PCB is an RBLOCK */
  err_tpdu.pcb = 0;
  SC_TPDU_T1_set_RBLOCK(&err_tpdu);
  SC_TPDU_T1_set_sequence(&err_tpdu, sequence_number);
  /* Put the error field */
  err_tpdu.pcb |= pcb_err;
  /* No data */
  err_tpdu.len  = 0;
  err_tpdu.data = NULL;
  /* Compute the checksum */
  SC_TPDU_T1_checksum_compute(&err_tpdu,fcrc);

  /* Send the error on the line */
  SC_push_TPDU_T1(&err_tpdu);

  return 0;
}

/* Get the type of an SBLOCK */
uint8_t SC_TPDU_T1_SBLOCK_get_type(SC_TPDU *tpdu){
  if(tpdu == NULL){
    return 0xff;
  }

  /* Return an error if this is not an SBLOCK */
  if(!SC_TPDU_T1_is_SBLOCK(tpdu)){
    return 0xff;
  }

  return (tpdu->pcb & SBLOCK_TYPE_MSK);
}

int SC_TPDU_T1_SBLOCK_get_waiting_time(SC_TPDU *tpdu, uint8_t *waiting_time){
  if((tpdu == NULL) || (waiting_time == NULL)){
    goto err;
  }

  *waiting_time = 0;
  /* Sanity check: is this an SBLOCK? */
  if(!SC_TPDU_T1_is_SBLOCK(tpdu)){
    goto err;
  }
  /* The waiting time should be encoded in a one byte data field
   * as a multiple of the BWT (Block Waiting Time).
   */
  if((tpdu->len != 1) || (tpdu->data == NULL)){
    goto err;
  }
  *waiting_time = tpdu->data[0];

  return 0;
err:
  return -1;
}
/* Get the new IFS asked by an SBLOCK */
int SC_TPDU_T1_SBLOCK_get_new_ifs(SC_TPDU *tpdu, uint8_t *new_ifs){
  if((tpdu == NULL) || (new_ifs == NULL)){
    goto err;
  }

  *new_ifs = 0;
  /* Sanity check: is this an SBLOCK? */
  if(!SC_TPDU_T1_is_SBLOCK(tpdu)){
    goto err;
  }
  /* The new IFS should be encoded in a one byte data field.
   */
  if((tpdu->len != 1) || (tpdu->data == NULL)){
    goto err;
  }
  *new_ifs = tpdu->data[0];

  return 0;
err:
  return -1;
}


/* Send an SBLOCK */
int SC_TPDU_T1_send_sblock(uint8_t sblock_type, uint8_t *data, uint8_t size,int fcrc)
{
  SC_TPDU s_tpdu;

  if(data == NULL)
  {
    return -1;
  }

  s_tpdu.nad = 0;

  /* PCB is an SBLOCK */
  s_tpdu.pcb = 0;
  SC_TPDU_T1_set_SBLOCK(&s_tpdu);
  /* Set the SBLOCK type */
  s_tpdu.pcb |= sblock_type;
  /* Is there data? No data */
  if(size > TPDU_T1_DATA_MAXLEN){
    /* Sanity check */
    return 0;
  }
  s_tpdu.len  = size;
  s_tpdu.data  = data;
  /* Compute the checksum */
  SC_TPDU_T1_checksum_compute(&s_tpdu,fcrc);

