purien/SCLIB-ARDUINO/SCLib5c/examples/smartcard7_test_stm32_esp32_t1_v2c.ino
  /* Send the SBLOCK on the line */
  SC_push_TPDU_T1(&s_tpdu);

  return 0;
}

// i block number of size ifsc
int SC_APDU_prepare_buffer(uint8_t *apdu, int len,uint8_t **buffer_send, int i, int ifsc,int * ret)
{  int size=0;
   
   if ( (i*ifsc) >= len ) {*ret=1;return 0;};
   
   *ret=0;
    size= len-(i*ifsc);
  if (size > ifsc) size= ifsc;
  *buffer_send= apdu+(i*ifsc);
  return size;
}


void SC_delay_BGT()
{ //delayMicroseconds(sc._bgt);
}

/* Send APDU in T=1 and get the response
 * [RB] FIXME: for now, this is a basic yet straightforward way of handling T=1. Some
 * error/corner cases are not implemented yet! However, this should work
 * for the basic interactions with cards we need.
 */

uint16_t SC_send_APDU_T1(uint8_t *apdu, unsigned int lena,uint8_t *resp,int ifsc, int fcrc)
{
  /* Create an IBLOCK in order to send our APDU */
  SC_TPDU tpdu_send;
  SC_TPDU tpdu_rcv ;
  unsigned int i, num_iblocks; //, bwi, cwi;
  /* Internal working buffers.
   * Note: we can work with only one buffer for both send and receive, but
   * this is cleaner to split those two for debug purposes. Additionally, the
   * buffers size is 254 bytes maximum imposed by the standard, which is reasonable
   * on our STM32F4 platform.
   */
  uint8_t *buffer_send ;
  
  unsigned int encapsulated_apdu_len=0;
  unsigned int received_size=0;
  uint8_t bwt_factor = 1; /* BWT factor for waiting time extension */
  t1_error=0;

  if( (apdu == NULL) || (resp == NULL) )
  {   lastpcb= 0x1F;
      goto err;
  }
  

  /* Compute the length we will have to send */
  encapsulated_apdu_len = lena; 

  /* How much IBLOCKS do we need? */

  num_iblocks = (encapsulated_apdu_len /ifsc) + 1;
  if(((encapsulated_apdu_len % ifsc) == 0) && (encapsulated_apdu_len != 0)){
    num_iblocks--;
  }
    
  //CWT CWT_character_wait_time
  //BWT BWT_block_wait_time

  /* Sanity zeroize */
  memset(&tpdu_rcv, 0, sizeof(tpdu_rcv))  ;
  memset(&tpdu_send, 0, sizeof(tpdu_send));

  /* NAD is always zero in our case (no multi-slaves) */
  tpdu_send.nad = 0; 

  /* Send all the IBLOCKS */
  for(i=0; i < num_iblocks; i++){
    int ret;
    tpdu_send.pcb = 0;
    /* PCB is an IBLOCK */
    SC_TPDU_T1_set_IBLOCK(&tpdu_send);
    if(i != (num_iblocks-1)){
      /* Blocks are chained except for the last one */
      tpdu_send.pcb |= PCB_M_CHAIN;
    }
    /* Set the sequence number */
    SC_TPDU_T1_set_sequence(&tpdu_send, last_send_sequence);
    /* Flip the sequence number for the next block to send */
    last_send_sequence = (last_send_sequence + 1) % 2;
    
    /* Compute the length to send and prepare the buffer */
    tpdu_send.len = SC_APDU_prepare_buffer(apdu,lena,&buffer_send,i,ifsc, &ret);
    
    if (ret)
    {   lastpcb= 0x1F;
      goto err;
    }

    /* Adapt the data pointer */
    tpdu_send.data = buffer_send;

    /* Compute the checksum */
    SC_TPDU_T1_checksum_compute(&tpdu_send,fcrc);

SEND_TPDU_AGAIN_CMD:
    /* Reset the BWT factor to 1 */
    bwt_factor = 1;
    /* Send the TPDU */
    if(SC_push_TPDU_T1(&tpdu_send))
    {   
      lastpcb= 0x1F;
      goto err;
    }
RECEIVE_TPDU_AGAIN_CMD:
    /* Get the ACK from the card */
    //tpdu_rcv.data = buffer_recv;
    tpdu_rcv.data = resp + received_size ;
    tpdu_rcv.len = 0;
    tpdu_rcv.edc_type = tpdu_send.edc_type;
        
    if(!SC_pull_TPDU_T1(&tpdu_rcv, bwt_factor))
    {
    /* If the checksum of the received block is wrong, 
       send an error R block and receive again */
      
       //SC_print_TPDU(&tpdu_rcv);

      if ( (!SC_TPDU_T1_checksum_check(&tpdu_rcv)) || t1_parity_error)
      {   
        t1_error++;
        if (t1_error > T1_ERROR_MAX) { lastpcb= 0x01; 
                                       goto err; }
        /* Wait a bit and send a parity error */
        SC_delay_BGT(); /* Wait for the standardized Block Guard Time (22 ETU by default) */
        
        SC_TPDU_T1_send_error(PCB_ERR_EDC, SC_TPDU_T1_get_sequence(&tpdu_rcv),fcrc);
        goto RECEIVE_TPDU_AGAIN_CMD;
      }
      /* If we have an error, send again */
      if(SC_TPDU_T1_is_RBLOCK(&tpdu_rcv) && (SC_TPDU_T1_RBLOCK_get_error(&tpdu_rcv) != PCB_ERR_NOERR))
      {
        /* Check the sequence number */
        if(SC_TPDU_T1_is_sequence_ok(&tpdu_rcv, SC_TPDU_T1_get_sequence(&tpdu_send)))
        {

            t1_error++;
            if (t1_error > T1_ERROR_MAX) {lastpcb= tpdu_rcv.pcb;goto err; }

          /* Genuine error, send again */
          SC_delay_BGT(); /* Wait for the standardized Block Guard Time (22 ETU by default) */
          goto SEND_TPDU_AGAIN_CMD;
        }
        /* Unexpected error */
        //printf("[Smartcard T=1] Unexpected case: received error block with bad sequence number ...\n");
        lastpcb= tpdu_rcv.pcb;
        goto err;
      }
      /* Check that this is the ACK we are waiting for */
      if(i != (num_iblocks - 1)){
        /* This is not the last block, we should receive a R type block with a last transmitted I Block sequence + 1 */
        if(!SC_TPDU_T1_is_RBLOCK(&tpdu_rcv) || !SC_TPDU_T1_is_sequence_ok(&tpdu_rcv, (SC_TPDU_T1_get_sequence(&tpdu_send) + 1) % 2))
        {   lastpcb= 0x03;
          /* This is not what we expect */
          //printf("[Smartcard T=1] Unexpected case: received other block than expected RBLOCK, or bad sequence number ...\n");
          goto err;
        }
      }
      else{
        /* This is the last block, we should receive at least one I type block with a last I Block received sequence + 1 value
         */
        if(!SC_TPDU_T1_is_IBLOCK(&tpdu_rcv) || !SC_TPDU_T1_is_sequence_ok(&tpdu_rcv, last_received_sequence)){
          /* If we have an error, send again */
          if(SC_TPDU_T1_is_RBLOCK(&tpdu_rcv) && (SC_TPDU_T1_RBLOCK_get_error(&tpdu_rcv) != PCB_ERR_NOERR)){
            /* Check the sequence number */
            if(SC_TPDU_T1_is_sequence_ok(&tpdu_rcv, SC_TPDU_T1_get_sequence(&tpdu_send)))
            {   
              t1_error++;
                    if (t1_error > T1_ERROR_MAX) { lastpcb= 0x04; goto err; }

              /* Genuine error, send again */
              SC_delay_BGT(); /* Wait for the standardized Block Guard Time (22 ETU by default) */
              goto SEND_TPDU_AGAIN_CMD;
            }
            /* Unexpected error */
            //printf("[Smartcard T=1] Unexpected case: received error block with bad sequence number ...\n");
            lastpcb= 31;
            goto err;
          }
          /* If this is something else, fallback to our error case ... */
          if(SC_TPDU_T1_is_SBLOCK(&tpdu_rcv)){
            /* If this is an SBLOCK we should not receive, this is an error ... */
            if((SC_TPDU_T1_SBLOCK_get_type(&tpdu_rcv) == SBLOCK_RESYNC_REQ) || (SC_TPDU_T1_SBLOCK_get_type(&tpdu_rcv) == SBLOCK_WAITING_RESP))
            {   lastpcb= 0x05;
              //printf("[Smartcard T=1] Unexpected SBLOCK reveived from smartcard (SBLOCK_RESYNC_REQ or SBLOCK_WAITING_RESP)\n");
              goto err;
            }
            /* If this is a Request Waiting Time extension, answer and go back to waiting our response ... */
            if(SC_TPDU_T1_SBLOCK_get_type(&tpdu_rcv) == SBLOCK_WAITING_REQ){
              /* Get the expected waiting time in number of BWT */
              if(SC_TPDU_T1_SBLOCK_get_waiting_time(&tpdu_rcv, &bwt_factor))
              { lastpcb= 0x06;
                goto err;
              }
              /* Acknowledge the waiting time */
              SC_delay_BGT(); /* Wait for the standardized Block Guard Time (22 ETU by default) */
              SC_TPDU_T1_send_sblock(SBLOCK_WAITING_RESP, tpdu_rcv.data, tpdu_rcv.len, fcrc);
              goto RECEIVE_TPDU_AGAIN_CMD;
            }
            if(SC_TPDU_T1_SBLOCK_get_type(&tpdu_rcv) == SBLOCK_CHANGE_IFS_REQ){
              /* Get the new IFSC */
              uint8_t new_ifsc;
              if(SC_TPDU_T1_SBLOCK_get_new_ifs(&tpdu_rcv, &new_ifsc))
              { lastpcb= 0x07;
                goto err;
              }
              if((new_ifsc == 0) || (new_ifsc == 255))
              {  lastpcb= 0x08;
                //printf("[Smartcard T=1] Bad value for IFSC asked with SBLOCK_CHANGE_IFS_REQ = %d\n", new_ifsc);
                goto err;
              }
              else{
                /* Record the new current IFSC in our ATR context: this will be actibe
                 * from now on for the next transactions.
                 */
                ifsc = new_ifsc;
                /* Acknowledge the new IFSC */
                SC_delay_BGT(); /* Wait for the standardized Block Guard Time (22 ETU by default) */
                SC_TPDU_T1_send_sblock(SBLOCK_CHANGE_IFS_RESP, tpdu_rcv.data, tpdu_rcv.len, fcrc);
                /* Go back to waiting the IBlock */
                goto RECEIVE_TPDU_AGAIN_CMD;
              }
            }
            /* Else, fallback to error since SBLOCKS are not fully implemented */
            //printf("[Smartcard T=1] S blocks automaton not fully implemented yet!\n");
             lastpcb= 9;goto err;
          }
          //printf("[Smartcard T=1] Unexpected case: received other block than expected IBLOCK, or bad sequence number ...\n");
          lastpcb= 10;goto err;
        }
        /* Now get out and receive other necessary I blocks */
      } // last block
    }
    else{
      /* Error pulling the response ... */
      // printf("[Smartcard T=1] TPDU response reception error 1 ...\n");
      lastpcb= 11;goto err;
    }
  } // next I-Bloc
  /* If we are here, we have received at least one IBlock. We have to check
   * if more blocks have to be received.
   */
  /* Reset the BWT factor to 1 */
  bwt_factor = 1;
  received_size += tpdu_rcv.len;
  tpdu_rcv.data = resp + received_size ;
    
  while(1)
  { // Flip the last reception sequence counter 
    last_received_sequence = (last_received_sequence + 1) % 2;
       
    /* More IBlocks are to be received */
    if((tpdu_rcv.pcb & PCB_M_MSK) == PCB_M_CHAIN){
      SC_delay_BGT(); /* Wait for the standardized Block Guard Time (22 ETU by default) */
      /* Send an ACK with the received IBlock sequence + 1 */
      SC_TPDU_T1_send_error(PCB_ERR_NOERR, (SC_TPDU_T1_get_sequence(&tpdu_rcv)+1)%2, fcrc);
RECEIVE_TPDU_AGAIN_RESP:
      /* Receive the new block */
      if(SC_pull_TPDU_T1(&tpdu_rcv, bwt_factor))
      {
        //printf("[Smartcard T=1] TPDU response reception error 2 ...\n");
       lastpcb= 12;
        goto err;
      }

            //SC_print_TPDU(&tpdu_rcv);

      /* If the checksum of the received block is wrong, send an error R block and receive again */
      if(!SC_TPDU_T1_checksum_check(&tpdu_rcv)){
        /* Wait a bit and send a parity error */
        SC_delay_BGT(); /* Wait for the standardized Block Guard Time (22 ETU by default) */
        SC_TPDU_T1_send_error(PCB_ERR_EDC, SC_TPDU_T1_get_sequence(&tpdu_rcv), fcrc);
        goto RECEIVE_TPDU_AGAIN_RESP;
      }
      /* If this is not an IBlock, check if this is an SBLOCK and perform the appropriate action.
       * [RB] TODO: handle the *full* resync automaton here instead of aborting ...
       */
      if(!SC_TPDU_T1_is_IBLOCK(&tpdu_rcv))
      {
        if(SC_TPDU_T1_is_SBLOCK(&tpdu_rcv)){
          /* If this is an SBLOCK we should not receive, this is an error ... */
          if((SC_TPDU_T1_SBLOCK_get_type(&tpdu_rcv) == SBLOCK_RESYNC_REQ) || (SC_TPDU_T1_SBLOCK_get_type(&tpdu_rcv) == SBLOCK_WAITING_RESP))
          {  lastpcb= 13;
            //printf("[Smartcard T=1] Unexpected SBLOCK received from smartcard (SBLOCK_RESYNC_REQ or SBLOCK_WAITING_RESP)\n");
            goto err;
          }
          /* If this is a Request Waiting Time extension, answer and go back to waiting our response ... */
          if(SC_TPDU_T1_SBLOCK_get_type(&tpdu_rcv) == SBLOCK_WAITING_REQ){
            /* Get the expected waiting time in number of BWT */
            if(SC_TPDU_T1_SBLOCK_get_waiting_time(&tpdu_rcv, &bwt_factor))
            { lastpcb= 14;
              goto err;
            }
            /* Acknowledge the waiting time */
            SC_delay_BGT(); /* Wait for the standardized Block Guard Time (22 ETU by default) */
            SC_TPDU_T1_send_sblock(SBLOCK_WAITING_RESP, tpdu_rcv.data, tpdu_rcv.len, fcrc);
            goto RECEIVE_TPDU_AGAIN_RESP;
          }
          if(SC_TPDU_T1_SBLOCK_get_type(&tpdu_rcv) == SBLOCK_CHANGE_IFS_REQ){
            /* The smartcard is negotiating a new IFSC, modify it */
            /* Get the new IFSC */
            uint8_t new_ifsc;
            if(SC_TPDU_T1_SBLOCK_get_new_ifs(&tpdu_rcv, &new_ifsc))
            {   lastpcb= 15;
              goto err;
            }
            if((new_ifsc == 0) || (new_ifsc == 255))
            {
              //printf("[Smartcard T=1] Bad value for IFSC asked with SBLOCK_CHANGE_IFS_REQ = %d\n", new_ifsc);
              lastpcb= 16;
              goto err;
            }
            ifsc = new_ifsc;
            /* Acknowledge the new IFSC */
            SC_delay_BGT(); /* Wait for the standardized Block Guard Time (22 ETU by default) */
            SC_TPDU_T1_send_sblock(SBLOCK_CHANGE_IFS_RESP, tpdu_rcv.data, tpdu_rcv.len, fcrc);
          }
          /* Else, fallback to error since SBLOCKS are not fully implemented */
          //printf("[Smartcard T=1] S blocks automaton not fully implemented yet!\n");

          lastpcb= 17;goto err;
        }
        else
        {
          //printf("[Smartcard T=1] TPDU response reception error: expected IBLOCK but got something else ...\n");
          lastpcb= 18;goto err;
        }
      } // end of I Block received
      /* Reset the BWT factor to 1 after each I-Block received */
      bwt_factor = 1;
      received_size += tpdu_rcv.len;
      tpdu_rcv.data =  resp + received_size ;

