purien/SCLIB-ARDUINO/SCLib5c/examples/smartcard7_test_stm32_esp32_t1_v2c.ino
    }
    else
    {
      /* We are finished, nothing more to get. Get out. */
      break;
    }
  }// While(1)
  
  /* We have received everything, format the response */
  return received_size ;

err:
  
  /* We have an error, clean up stuff */
  return 0;
}

#define BADSW1 0x6F
int send_apdu(char *req, int asize, char *resp, bool foutput,bool first)
{
  boolean do_verbose = fdebug ;
  boolean f_wr = true;
  APDU_t   command;
  int i, PSIZE = 16;
  char v[5];
  unsigned long t1,t2;
  int t1rx=0;
  uint16_t result ;
    
 if (do_verbose)
  { MySerial.print("Tx: ");
    for (i = 0; i < asize; i++)
    { sprintf(v, "%02X", 0xFF & req[i]);
      MySerial.print(v);
      if ((i % PSIZE) == (PSIZE - 1) ) {
        MySerial.println();
        MySerial.print("    ");
      }
    }
    if ((i % PSIZE) != 0) MySerial.println();
  }

  if (myptcol == (char)0)
  {  
  command.cla       = (unsigned char)req[0] ;
  command.ins       = (unsigned char)req[1] ;
  command.p1        = (unsigned char)req[2] ;
  command.p2        = (unsigned char)req[3] ;
  command.data_size = (unsigned char) req[4] & 0xFF  ;
  if (asize == 5)
  { f_wr = false ;
    command.data_buf  = (unsigned char *)resp;
    if (foutput) command.data_size= 256;
  }
  else
   command.data_buf  = (unsigned char *)&req[5];
 
  command.resp_size = 0x100 ;
  }

  else // T=1
  { t1rx=254+4; //Max + 4
    if (mycrc) t1rx += 1;
  }

  //  uint16_t sc.sendAPDU(APDU_t* command, boolean send=true, uint16_t maxwaits=0); 
  // return 0 if error

  if (myptcol == (char)0) 
  { if (do_verbose) t1=micros();
    result = sc.sendAPDU(&command, f_wr, 10000); // timeout 10s
    if (result == 0)
    { command.resp_length = 0;
      result=0x6F00;
    }
  }
  else // t=1
  { if (do_verbose) t1=micros();

    // return size of response, at least 2
    result= SC_send_APDU_T1((uint8_t *)req,asize,(uint8_t *)resp,myifs,mycrc);
    t1rx=result;

    if (result <= 1)
    { command.resp_length=0;resp[0]=BADSW1;resp[1]=lastpcb ;t1rx=2;
      result =  0xFF00 & resp[0]<<8; 
      result |= 0xFF   & resp[1];
      goto sendend;
    }
    result =  0xFF00 & (resp[t1rx-2]<<8); // SW1 SW2
    result |= 0xFF   & resp[t1rx-1];
    command.resp_length = 0xFF & (t1rx-2);
   }

  sendend:
  
  if (do_verbose) t2=micros();

  if (do_verbose)
  { 
    if (myptcol == (char)0)
    { MySerial.print("APDU Error = ");MySerial.println(sc.lasterror);
    for (i = 0; i < sc.pbufs; i++)
    { sprintf(v, "%02X", 0xFF & sc.bufs[i]);
      MySerial.print(v);
      if ((i % PSIZE) == (PSIZE - 1) ) 
      {
      MySerial.println();
      }
    }
    if ((i % PSIZE) != 0) MySerial.println();
    }
  }

  if (do_verbose)
  { MySerial.print("Rx[");MySerial.print((t2-t1)/1000);MySerial.println("ms]: ");
    
    if ( ((!f_wr) || (myptcol != (char)0)) &&  (command.resp_length != 0) )
    { MySerial.print("    ");
      for (i = 0; i < command.resp_length; i++)
      { sprintf(v, "%02X", 0xFF & resp[i]);
        MySerial.print(v);
        if ((i % PSIZE) == (PSIZE - 1) ) 
        {
          MySerial.println();
          MySerial.print("    ");
        }
      }
    }

    if ( (command.resp_length != 0) && ((i % PSIZE) != 0) )
    {
      MySerial.println();
      MySerial.print("    ");
    }
    
    MySerial.println(result, HEX); // SW1 SW2
    MySerial.println();
  }


  if (myptcol != (char)0)
  { 
    return t1rx ;
  }

  if (!f_wr)
    asize = command.resp_length ;
  else
    asize = 0;

  resp[asize] =   (result >> 8) & 0xFF ;
  resp[asize + 1] = result & 0xFF;

  if (first)
  {
  if ((asize == 0) && (resp[0] == (char)0x61) )
  {
    if (resp[1]== 0) foutput=true;
    else             foutput=false;
    req[0]=0;
    req[1]=0xC0;
    req[2]=0;
    req[3]=0;
    req[4]=resp[1];
    
    return send_apdu(req,5,resp,foutput,false);
    
  }

 if ((asize == 0) && (resp[0] == (char)0x6C) )
  {
    if (resp[1]== 0) foutput=true;
    else             foutput=false;
    req[0]=command.cla;
    req[1]=command.ins;
    req[2]=command.p1;
    req[3]=command.p2;
    req[4]=resp[1];
    
    return send_apdu(req,5,resp,foutput,false);
    
  }
 }
 
  return  asize + 2;

}
